[
    {
        "name": "Media Tracker",
        "description": "This is an app I designed and made as part of my A Level Computer Science course. Users are able to create an account, search for and log a title into different lists (Completed, Planning, etc) and add their rating. I used Python Tkinter for the front-end, along with SQL and  IMDb's open-source database for the back-end. I was not able to complete the 'Genres' and 'Years released' features due to time constraints, however I planned to allow users to browse titles based on their genre or year of release.",
        "role": "Full-stack",
        "icon": "assets/icons/media-tracker.png",
        "link": "",
        "api": "",
        "repo": "https://github.com/zeinabro/media-tracker/",
        "docs": "",
        "group": "n",
        "card": "./assets/cards/media-tracker.jpg",
        "screenshots": "assets/screenshots/media-tracker"
    },
    {
        "name": "Art Quiz",
        "description": "This is the first project I have worked on with JavaScript. This app was designed to motivate students to enjoy non-STEM subjects. Users are given a set of zoomed in paintings in which they must select the artist of. After a wrong guess, more of the painting is revealed. They are awarded points based on how many guesses it took to find the correct answer. I worked on the front-end with HTML, CSS and vanilla JavaScript.",
        "role": "Front-end",
        "icon": "assets/icons/art-quiz.png",
        "link": "https://zeinabro.github.io/art-quiz/",
        "api": "https://lap1-project-backend.onrender.com/",
        "repo": "https://github.com/anthonychan1211/Lap-1-project-quiz",
        "docs": "",
        "group": "y",
        "card": "assets/cards/art-quiz.jpg",
        "screenshots": "assets/screenshots/art-quiz"
    },
    {
        "name": "Florinate",
        "description": "In this group project, we built an app to help enhance a fictional community called 'Florin'. I worked on both the front and back-end, as well as testing the front-end, with vanilla JS, Node.js, Express and Jest. Users are able to create an account, create and apply to job listings, create and bookmark events, create and join skill classes and, finally, view all of these on their profile.",
        "role": "Full-stack, QA",
        "icon": "assets/icons/florinate.png",
        "link": "https://florinate-client.onrender.com/",
        "api": "https://florinate-api.onrender.com/",
        "repo": "https://github.com/JacobBrooks0/Lap2-Project",
        "docs": "",
        "presentation": "https://1drv.ms/p/s!Av5LawaAE339goEk6Hr9QwDJbm3R7g?e=LafW4q",
        "group": "y",
        "card": "assets/cards/florinate.jpg",
        "screenshots": "assets/screenshots/florinate"
    },
    {
        "name": "Pokrastemon",
        "description": "This app uses the well-loved franchise Pokémon and study technique 'pomodoro' to help motivate users, with a focus on students, to study. Users can create an account, write to-do lists and configure their pomodoro timer. After they have completed a study session, they are awarded with a key. Once they have collected three keys, they can 'open' a treasure chest and be rewarded with a new Pokémon in the library page. I worked on the both the front and back-end of this project, using Node.js, Express and React.",
        "role": "Full-stack",
        "icon": "assets/icons/pokrastemon.png",
        "link": "https://pokrastemon.onrender.com/",
        "api": "https://pokrastemon-api.onrender.com/",
        "repo": "https://github.com/kieranscutt/Pokrastemon-app",
        "docs": "",
        "presentation": "https://1drv.ms/p/s!Av5LawaAE339goEmA62b2kMTJ8Z1Wg?e=uJgDaA",
        "group": "y",
        "card": "assets/cards/pokrastemon.jpg",
        "screenshots": "assets/screenshots/pokrastemon"
    },
    {
        "name": "Sight Reader",
        "description": "This is a web app designed to help users practise their sight-reading skills. Users are able to make/complete assignments, message friends and earn points to appear on a leader-board. Users can play the given notes using their voice or an instrument into their device's microphone, where a pitch detector will assess whether they have played the correct notes. If yes, the note will change to a green colour and the next question will appear. We also created an algorithm to award points based on the difficulty of the assignment and how long the user took to complete the set of questions (the points are only awarded for assignments). I worked on the API routes and database on the back-end and the account page on the front-end with Node.js, Express and React.",
        "role": "Full-stack",
        "icon": "assets/icons/sight-reader.png",
        "link": "https://sightreader.onrender.com/",
        "api": "https://sight-reader-api.onrender.com/",
        "repo": "https://github.com/SumeetChoat/thefinalproject",
        "docs": "",
        "presentation":"https://1drv.ms/p/s!Av5LawaAE339goErt8zS9_Ce_48xPg?e=h95iiH",
        "group": "y",
        "card": "assets/cards/sight-reader.jpg",
        "screenshots": "assets/screenshots/sight-reader"
    },
    {
        "name": "Hangman",
        "description": "A simple hangman game I built using vanilla JS, HTML and CSS. I used an external API to generate random words.",
        "role": "Front-end",
        "icon": "assets/icons/hangman.png",
        "link": "https://zeinabro.github.io/hangman/",
        "api": "",
        "repo": "https://github.com/zeinabro/hangman",
        "docs": "",
        "group": "n",
        "card": "assets/icons/hangman.png",
        "screenshots": "assets/screenshots/hangman"
    },
    {
        "name": "Theatre App",
        "description":"An unfinished webpage for an imaginary theatre's administration to view and edit their shows and screenings. I worked on this in a pair, focusing on the back-end. We used vanilla JS, HTML, CSS, Node.js and Express.",
        "role":"Back-end",
        "icon": "assets/icons/theatre.png",
        "link": "https://zeinabro.github.io/theatre-app/",
        "api": "https://plays-api.onrender.com/",
        "repo": "https://github.com/zeinabro/theatre-app",
        "group": "y",
        "card": "",
        "screenshots": "assets/screenshots/theatre"
    }
]
